// Задача 2
Console.WriteLine("Введите первое число");
int a = Convert.ToInt32(Console.ReadLine ());
Console.WriteLine("Введите второе число");
int b = Convert.ToInt32(Console.ReadLine ());
if (a > b)
{
    Console.WriteLine("Первое число больше второго");
}
if (a == b)
{
     Console.WriteLine("Числа равны");
}
if (a < b)
{
     Console.WriteLine("Второе число больше первого");
}
    