// Задача 6
Console.WriteLine("Введите число");
int a = int.Parse(Console.ReadLine());
if (a % 2 == 0)
{
    Console.WriteLine("Четное число");
}
else
{
     Console.WriteLine("нечетное число");
}